backend/controllers/ProductController.php

    public function actionCreate()
    {
        $model = new Product();
        $uploadModel = new UploadForm();
        $category =Category::find()->select('cate_id,cate_name')->all();
---
SELECT `cate_id`, `cate_name` FROM `category`